{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 1,
   "id": "1e20c747",
   "metadata": {},
   "outputs": [],
   "source": [
    "from rdflib import Graph\n",
    "from SPARQLWrapper import SPARQLWrapper, JSON"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "4322217e",
   "metadata": {},
   "outputs": [],
   "source": [
    "# Endpoint\n",
    "sparql = SPARQLWrapper(\"https://shared.semantics.cancer.gov/sparql\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "id": "2b4fe195",
   "metadata": {},
   "outputs": [],
   "source": [
    "# Query for Alzheimer's (C2866)\n",
    "query_string = \"\"\"\n",
    "PREFIX ncit: <http://ncicb.nci.nih.gov/xml/owl/EVS/Thesaurus.owl#>\n",
    "PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\n",
    "PREFIX owl: <http://www.w3.org/2002/07/owl#>\n",
    "\n",
    "SELECT DISTINCT ?prop_label ?prop_value\n",
    "FROM <http://ncicb.nci.nih.gov/xml/owl/EVS/ThesaurusInf.rdf>\n",
    "WHERE {\n",
    "  # Filter for the specific Alzheimer's Subject Code\n",
    "  VALUES ?subject { ncit:C2866 }\n",
    "\n",
    "  ?subject ?prop ?prop_value .\n",
    "  ?prop rdfs:label ?prop_label .\n",
    "  ?prop a owl:AnnotationProperty .\n",
    "}\n",
    "ORDER BY ?prop_label\n",
    "LIMIT 20\n",
    "\"\"\""
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "id": "6569fd7a",
   "metadata": {},
   "outputs": [],
   "source": [
    "sparql.setQuery(query_string)\n",
    "sparql.setReturnFormat(JSON)\n",
    "results = sparql.query().convert()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "id": "4c999b64",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Property Label                 | Value\n",
      "--------------------------------------------------------------------------------\n",
      "ALT_DEFINITION                 | A brain disorder that usually starts in late middle age or old age and gets worse over time. Symptoms include loss of memory, confusion, difficulty thinking, and changes in language, behavior, and per...\n",
      "Concept_In_Subset              | http://ncicb.nci.nih.gov/xml/owl/EVS/Thesaurus.owl#C179027...\n",
      "Concept_In_Subset              | http://ncicb.nci.nih.gov/xml/owl/EVS/Thesaurus.owl#C193184...\n",
      "Concept_In_Subset              | http://ncicb.nci.nih.gov/xml/owl/EVS/Thesaurus.owl#C158520...\n",
      "Concept_In_Subset              | http://ncicb.nci.nih.gov/xml/owl/EVS/Thesaurus.owl#C189083...\n",
      "Concept_In_Subset              | http://ncicb.nci.nih.gov/xml/owl/EVS/Thesaurus.owl#C158034...\n",
      "Concept_In_Subset              | http://ncicb.nci.nih.gov/xml/owl/EVS/Thesaurus.owl#C158035...\n",
      "Concept_In_Subset              | http://ncicb.nci.nih.gov/xml/owl/EVS/Thesaurus.owl#C193006...\n",
      "Concept_In_Subset              | http://ncicb.nci.nih.gov/xml/owl/EVS/Thesaurus.owl#C165258...\n",
      "Concept_In_Subset              | http://ncicb.nci.nih.gov/xml/owl/EVS/Thesaurus.owl#C156952...\n",
      "Contributing_Source            | CPTAC...\n",
      "Contributing_Source            | mCode...\n",
      "Contributing_Source            | SeroNet...\n",
      "Contributing_Source            | Cellosaurus...\n",
      "DEFINITION                     | A progressive, neurodegenerative disease characterized by loss of function and death of nerve cells in several areas of the brain leading to loss of cognitive function such as memory and language....\n",
      "FULL_SYN                       | Alzheimer's Disease...\n",
      "FULL_SYN                       | Alzheimer disease...\n",
      "FULL_SYN                       | Alzheimer's Dementia...\n",
      "FULL_SYN                       | Alzheimer's disease...\n",
      "FULL_SYN                       | Alzheimer's disease, unspecified...\n"
     ]
    }
   ],
   "source": [
    "# 3. Print Results\n",
    "print(f\"{'Property Label':<30} | {'Value'}\")\n",
    "print(\"-\" * 80)\n",
    "for result in results[\"results\"][\"bindings\"]:\n",
    "    label = result[\"prop_label\"][\"value\"]\n",
    "    value = result[\"prop_value\"][\"value\"]\n",
    "    # Truncate long values for cleaner printing\n",
    "    print(f\"{label:<30} | {value[:200]}...\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "058aa62d",
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": ".venv",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.13.3"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
